#pragma once
#include "c_base_combat_weapon.hpp"
#include "../interfaces/interfaces.hpp"
#include "i_client_entity.hpp"
#include "c_base_handle.hpp"
#include "../../utilities/math/math.hpp"
#include "c_base_entity.hpp"

class c_base_player;

enum data_update_type_t {
	data_update_created = 0,
	data_update_datatable_changed,
};

enum client_frame_stage_t {
	frame_undefined = -1,
	frame_start,
	frame_net_update_start,
	frame_net_update_postdataupdate_start,
	frame_net_update_postdataupdate_end,
	frame_net_update_end,
	frame_render_start,
	frame_render_end
};

enum move_type {
	movetype_none = 0,
	movetype_isometric,
	movetype_walk,
	movetype_step,
	movetype_fly,
	movetype_flygravity,
	movetype_vphysics,
	movetype_push,
	movetype_noclip,
	movetype_ladder,
	movetype_observer,
	movetype_custom,
	movetype_last = movetype_custom,
	movetype_max_bits = 4,
	max_movetype
};

enum entity_activities : int {
	act_invalid = -1,
	act_reset = 0,
	act_idle = 1,
	act_transition = 2,
	act_cover = 3,
	act_cover_med = 4,
	act_cover_low = 5,
	act_walk = 6,
	act_walk_aim = 7,
	act_walk_crouch = 8,
	act_walk_crouch_aim = 9,
	act_run = 10,
	act_run_aim = 11,
	act_run_crouch = 12,
	act_run_crouch_aim = 13,
	act_run_protected = 14,
	act_script_custom_move = 15,
	act_range_attack1 = 16,
	act_range_attack2 = 17,
	act_range_attack1_low = 18,
	act_range_attack2_low = 19,
	act_diesimple = 20,
	act_diebackward = 21,
	act_dieforward = 22,
	act_dieviolent = 23,
	act_dieragdoll = 24,
	act_fly = 25,

	act_dota_override_ability_2 = 933,
	act_dota_override_ability_3 = 934,
	act_dota_override_ability_4 = 935,
	act_dota_channel_ability_1 = 936,
	act_dota_channel_ability_2 = 937,
	act_dota_channel_ability_3 = 938,
	act_dota_channel_ability_4 = 939,
	act_dota_channel_end_ability_1 = 940,
	act_dota_channel_end_ability_2 = 941,
	act_dota_channel_end_ability_3 = 942,
	act_dota_channel_end_ability_4 = 943,
	act_mp_run_speedpaint = 944,
	act_mp_long_fall = 945,
	act_mp_tractorbeam_float = 946,
	act_mp_death_crush = 947,
	act_mp_run_speedpaint_primary = 948,
	act_mp_drowning_primary = 949,
	act_mp_long_fall_primary = 950,
	act_mp_tractorbeam_float_primary = 951,
	act_mp_death_crush_primary = 952,
	act_die_stand = 953,
	act_die_stand_headshot = 954,
	act_die_crouch = 955,
	act_die_crouch_headshot = 956,
	act_csgo_null = 957,
	act_csgo_defuse = 958,
	act_csgo_defuse_with_kit = 959,
	act_csgo_flashbang_reaction = 960,
	act_csgo_fire_primary = 961,
	act_csgo_fire_primary_opt_1 = 962,
	act_csgo_fire_primary_opt_2 = 963,
	act_csgo_fire_secondary = 964,
	act_csgo_fire_secondary_opt_1 = 965,
	act_csgo_fire_secondary_opt_2 = 966,
	act_csgo_reload = 967,
	act_csgo_reload_start = 968,
	act_csgo_reload_loop = 969,
	act_csgo_reload_end = 970,
	act_csgo_operate = 971,
	act_csgo_deploy = 972,
	act_csgo_catch = 973,
	act_csgo_silencer_detach = 974,
	act_csgo_silencer_attach = 975,
	act_csgo_twitch = 976,
	act_csgo_twitch_buyzone = 977,
	act_csgo_plant_bomb = 978,
	act_csgo_idle_turn_balanceadjust = 979,
	act_csgo_idle_adjust_stoppedmoving = 980,
	act_csgo_alive_loop = 981,
	act_csgo_flinch = 982,
	act_csgo_flinch_head = 983,
	act_csgo_flinch_molotov = 984,
	act_csgo_jump = 985,
	act_csgo_fall = 986,
	act_csgo_climb_ladder = 987,
	act_csgo_land_light = 988,
	act_csgo_land_heavy = 989,
	act_csgo_exit_ladder_top = 990,
	act_csgo_exit_ladder_bottom = 991,
	act_csgo_parachute = 992,
	act_csgo_uiplayer_idle = 993,
	act_csgo_uiplayer_walkup = 994,
	act_csgo_uiplayer_celebrate = 995,
	act_csgo_uiplayer_confirm = 996,
	act_csgo_uiplayer_buymenu = 997,
	act_csgo_uiplayer_patch = 998,
	activity_list_max
};

enum entity_flags {
	fl_onground = ( 1 << 0 ),
	fl_ducking = ( 1 << 1 ),
	fl_waterjump = ( 1 << 2 ),
	fl_ontrain = ( 1 << 3 ),
	fl_inrain = ( 1 << 4 ),
	fl_frozen = ( 1 << 5 ),
	fl_atcontrols = ( 1 << 6 ),
	fl_client = ( 1 << 7 ),
	fl_fakeclient = ( 1 << 8 ),
	fl_inwater = ( 1 << 9 ),
	fl_fly = ( 1 << 10 ),
	fl_swim = ( 1 << 11 ),
	fl_conveyor = ( 1 << 12 ),
	fl_npc = ( 1 << 13 ),
	fl_godmode = ( 1 << 14 ),
	fl_notarget = ( 1 << 15 ),
	fl_aimtarget = ( 1 << 16 ),
	fl_partialground = ( 1 << 17 ),
	fl_staticprop = ( 1 << 18 ),
	fl_graphed = ( 1 << 19 ),
	fl_grenade = ( 1 << 20 ),
	fl_stepmovement = ( 1 << 21 ),
	fl_donttouch = ( 1 << 22 ),
	fl_basevelocity = ( 1 << 23 ),
	fl_worldbrush = ( 1 << 24 ),
	fl_object = ( 1 << 25 ),
	fl_killme = ( 1 << 26 ),
	fl_onfire = ( 1 << 27 ),
	fl_dissolving = ( 1 << 28 ),
	fl_transragdoll = ( 1 << 29 ),
	fl_unblockable_by_player = ( 1 << 30 )
};

/* other structs */
struct animstate_pose_param_cache_t {
	std::uint8_t pad_0x0[ 0x4 ]; //0x0
	std::uint32_t m_idx; //0x4 
	char* m_name; //0x8

	void set_value( c_base_player* e, float val );
};

class animstate_t {
public:
	std::uint8_t pad_0x0000[ 0x4 ]; //0x0000
	bool m_force_update; //0x0005 
	std::uint8_t pad_0x0006[ 0x5A ]; //0x0006
	c_base_entity* m_entity; //0x0060 
	c_base_combat_weapon* m_weapon; //0x0064 
	c_base_combat_weapon* m_last_weapon; //0x0068 
	float m_last_clientside_anim_update; //0x006C 
	uint32_t m_last_clientside_anim_framecount; //0x0070 
	float m_last_clientside_anim_update_time_delta; //0x0074 
	float m_eye_yaw; //0x0078 
	float m_pitch; //0x007C 
	float m_abs_yaw; //0x0080 
	float m_feet_yaw; //0x0084 
	float m_body_yaw; //0x0088 
	float m_body_yaw_clamped; //0x008C 
	float m_feet_vel_dir_delta; //0x0090 
	uint8_t pad_0x0094[ 0x4 ]; //0x0094
	float m_feet_cycle; //0x0098 
	float m_feet_yaw_rate; //0x009C 
	uint8_t pad_0x00A0[ 0x4 ]; //0x00A0
	float m_duck_amount; //0x00A4 
	float m_landing_duck_additive; //0x00A8 
	uint8_t pad_0x00AC[ 0x4 ]; //0x00AC
	vec3_t m_origin;
	vec3_t m_old_origin;
	vec3_t m_velocity;
	vec3_t m_velocity_normalized;
	vec3_t m_last_accelerating_vel;
	float m_speed2d;
	float m_abs_velocity;
	float m_speed_normalized;
	float m_run_speed; //0x00F8 
	float m_duck_speed; //0x00FC 
	float m_time_since_move; //0x0100 
	float m_time_since_stop; //0x0104 
	bool m_on_ground; //0x0108 
	bool m_hit_ground; //0x0109 
	uint8_t pad_0x010A[ 0x4 ]; //0x010A
	float m_time_in_air; //0x0110 
	uint8_t pad_0x0114[ 0x6 ]; //0x0114
	float m_ground_fraction; //0x011C 
	uint8_t pad_0x0120[ 0x2 ]; //0x0120
	float m_unk_fraction; //0x0124 
	uint8_t pad_0x0128[ 0xC ]; //0x0128
	bool m_moving; //0x0134
	uint8_t pad_0x0135[ 0x7B ]; //0x0135
	animstate_pose_param_cache_t m_lean_yaw_pose; //0x1B0
	animstate_pose_param_cache_t m_speed_pose; //0x01BC
	animstate_pose_param_cache_t m_ladder_speed_pose; //0x01C8
	animstate_pose_param_cache_t m_ladder_yaw_pose; //0x01D4
	animstate_pose_param_cache_t m_move_yaw_pose; //0x01E0
	animstate_pose_param_cache_t m_run_pose; //0x01EC 
	animstate_pose_param_cache_t m_body_yaw_pose; //0x01F8
	animstate_pose_param_cache_t m_body_pitch_pose; //0x0204
	animstate_pose_param_cache_t m_dead_yaw_pose; //0x0210
	animstate_pose_param_cache_t m_stand_pose; //0x021C
	animstate_pose_param_cache_t m_jump_fall_pose; //0x0228
	animstate_pose_param_cache_t m_aim_blend_stand_idle_pose; //0x0234
	animstate_pose_param_cache_t m_aim_blend_crouch_idle_pose; //0x0240
	animstate_pose_param_cache_t m_strafe_yaw_pose; //0x024C
	animstate_pose_param_cache_t m_aim_blend_stand_walk_pose; //0x0258
	animstate_pose_param_cache_t m_aim_blend_stand_run_pose; //0x0264
	animstate_pose_param_cache_t m_aim_blend_crouch_walk_pose; //0x0270
	animstate_pose_param_cache_t m_move_blend_walk_pose; //0x027C
	animstate_pose_param_cache_t m_move_blend_run_pose; //0x0288
	animstate_pose_param_cache_t m_move_blend_crouch_pose; //0x0294
	uint8_t pad_0x02A0[ 0x4 ]; //0x02A0
	float m_vel_unk; //0x02A4 
	uint8_t pad_0x02A8[ 0x86 ]; //0x02A8
	float m_min_yaw; //0x0330 
	float m_max_yaw; //0x0334 
	float m_max_pitch; //0x0338 
	float m_min_pitch; //0x033C

	void reset( );
	void update( vec3_t& ang );

	float& time_since_in_air( ) {
		return *( float* ) ( ( uintptr_t ) this + 0x110 );
	}

	float& yaw_desync_adjustment( ) {
		return *( float* ) ( ( uintptr_t ) this + 0x334 );
	}

	bool& m_smooth_height_valid( ) {
		return *( bool* ) ( ( uintptr_t ) this + 0x328 );
	}
}; //Size=0x0340

struct animlayer_t {
	char pad_0x01[ 0x14 ];
	int	m_order;
	int	m_sequence;
	float m_previous_cycle;
	float m_weight;
	float m_weight_delta_rate;
	float m_playback_rate;
	float m_cycle;
	void* m_owner;
	char pad_0x02[ 0x4 ];
};

enum animlayer_stages
{
	main_idle_sequence_layer = 0, //0	 for 8-way blended models, this layer blends an idle on top of the run/walk animation to simulate a 9-way blend.
	//	 for 9-way blended models, we don't use this layer.
	aimsequence_layer1, //1	 aim sequence uses layers 0 and 1 for the weapon idle animation (needs 2 layers so it can blend).
	aimsequence_layer2, //2
	lowerbody_layer, //3
